# GBXMLImportOptions Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GBXMLImportOptions Class
Members See Also
---
Import options for Green-Building XML format.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class GBXMLImportOptions
```

Visual Basic
---
```text
Public Class GBXMLImportOptions
```

Visual C++
---
```text
public ref class GBXMLImportOptions
```

# Remarks
Not used currently. Reserved for future use.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..GBXMLImportOptions
# See Also
GBXMLImportOptions Members
Autodesk.Revit.DB Namespace